stow-away/all_posts.org
* Systems
** MacOS :macos:
:PROPERTIES:
:EXPORT_FILE_NAME: MacOS
:END:
*** Setup
1. Sign into iCloud and Apple ID, enable telemetry and app store
2. Install [[https://brew.sh/][Homebrew]]
   #+begin_src bash
   /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
   #+end_src
3. Sign into Github Desktop and clone this repo to ~/dotfiles
4. cd code directory and install everything with `brew bundle`
   this will include App Store Apps via mas-cli
5. install pipx packages
      #+begin_src bash
         cat /code/pipx-requirements.txt | xargs -I {} pipx install {}
      #+end_src
7. Install [[https://cardo-podcast.github.io/][Cardo]] Podcast App
8. Install Claude Macos [[https://docs.claude.com/en/docs/claude-code/setup][Native Binary Install]]
